furmilion/furnace-fur/src/engine/platform/stm32crapsynth.cpp

/**
 * Furnace Tracker - multi-system chiptune tracker
 * Copyright (C) 2021-2024 tildearrow and contributors
 *
 * This program is free software; you can redistribute it and/or modify
 * it under the terms of the GNU General Public License as published by
 * the Free Software Foundation; either version 2 of the License, or
 * (at your option) any later version.
 *
 * This program is distributed in the hope that it will be useful,
 * but WITHOUT ANY WARRANTY; without even the implied warranty of
 * MERCHANTABILITY or FITNESS FOR A PARTICULAR PURPOSE.  See the
 * GNU General Public License for more details.
 *
 * You should have received a copy of the GNU General Public License along
 * with this program; if not, write to the Free Software Foundation, Inc.,
 * 51 Franklin Street, Fifth Floor, Boston, MA 02110-1301 USA.
 */

#include "stm32crapsynth.h"
#include "../engine.h"
#include "furIcons.h"
#include <math.h>

//#define rWrite(a,v) pendingWrites[a]=v;
#define rWrite(a,v) if (!skipRegisterWrites) {writes.push(QueuedWrite(a,v)); if (dumpWrites) {addWrite(a,v);} }

#define ad9833_write(ch,type,val) rWrite(((ch << 8) | (type)), val)

#define CHIP_FREQBASE 524288*16
#define CHIP_TIMERS_FREQBASE 524288*64
#define CHIP_DIVIDER 1

const char* regCheatSheetCrapSynth[]={
  ".", "0",
  NULL
};

const char** DivPlatformSTM32CRAPSYNTH::getRegisterSheet() {
  return regCheatSheetCrapSynth;
}

void DivPlatformSTM32CRAPSYNTH::acquire(short** buf, size_t len) {
  for (size_t h=0; h<len; h++) 
  {
    for(int i = 0; i < 4; i++)
    {
      crapsynth_clock(crap_synth);
    }
    
    for (int i=0; i<STM32CRAPSYNTH_NUM_CHANNELS; i++) 
    {
      oscBuf[i]->data[oscBuf[i]->needle++]=CLAMP(crap_synth->chan_outputs[i],-32768,32767);
    }

    if (!writes.empty()) 
    {
      QueuedWrite w=writes.front();
      int ch = w.addr >> 8;
      int type = w.addr & 0xff;
      crapsynth_write(crap_synth, ch, type, w.val);
      if(ch < 5)
      {
        regPool[ch * 8 + type]=w.val;
      }
      if(ch == 5 || ch == 6 || ch == 7) //DAC
      {
        regPool[5 * 8 + (ch - 5) * 16 + type]=w.val;
      }
      if(ch > 7)
      {
        regPool[5 * 8 + 3 * 16 + (ch - 8) * 8 + type]=w.val;
      }
      
      writes.pop();
    }

    float dVbp = (w0_ceil_1 * Vhp);
    float dVlp = (w0_ceil_1 * Vbp);
    Vbp += dVbp;
    Vlp += dVlp;
    Vhp = (float)CLAMP(crap_synth->final_output,-32768,32767) - (Vbp * _1024_div_Q) - Vlp;

    buf[0][h]=Vhp;
  }
}

void DivPlatformSTM32CRAPSYNTH::updateWave(int ch) {
  if(ch > 4 && ch < 8)
  {
    if(chan[ch].wave == 6 || chan[ch].wave == 7) return;
    bool need_update = false;
    for (int i=0; i<STM32CRAPSYNTH_WAVETABLE_SIZE; i++) {
      if(chan[ch].ws.output[i] != (int)crap_synth->dac[ch-5].wavetable[i])
      {
        need_update = true;
        break;
      }
    }
    if(!need_update) return;
    for (int i=0; i<STM32CRAPSYNTH_WAVETABLE_SIZE; i++) {
      ad9833_write(ch, 10, (chan[ch].ws.output[i]) | (i << 8));
    }
  }
}

void DivPlatformSTM32CRAPSYNTH::tick(bool sysTick) 
{
  for (int i=0; i<STM32CRAPSYNTH_NUM_CHANNELS; i++) 
  {
    chan[i].std.next();

    if (chan[i].std.vol.had) { //for ch3 PWM vol correction.... (faulty mux out line?)
      if(i < 8)
      {
        if(i != 7)
        {
          chan[i].outVol=VOL_SCALE_LOG(chan[i].vol&255,MIN(255,chan[i].std.vol.val),255);
        }
        else
        {
          chan[i].outVol=VOL_SCALE_LINEAR(chan[i].vol&255,MIN(255,chan[i].std.vol.val),255);
        }
        
        ad9833_write(i, 0, chan[i].outVol);
      }
    }
    
    if (NEW_ARP_STRAT) {
      chan[i].handleArp();
    } else if (chan[i].std.arp.had) {
      if (!chan[i].inPorta) {
        chan[i].baseFreq=NOTE_FREQUENCY(parent->calcArp(chan[i].note,chan[i].std.arp.val));
      }
      chan[i].freqChanged=true;
    }
    
    if (chan[i].std.pitch.had) {
      if (chan[i].std.pitch.mode) {
        chan[i].pitch2+=chan[i].std.pitch.val;
        CLAMP_VAR(chan[i].pitch2,-32768,32767);
      } else {
        chan[i].pitch2=chan[i].std.pitch.val;
      }
      chan[i].freqChanged=true;
    }

    if (chan[i].std.wave.had) {
      if(i < 4)
      {
        ad9833_write(i, 1, chan[i].std.wave.val);

        if((chan[i].std.wave.val == 5 && chan[i].wave != 5) || (chan[i].std.wave.val != 5 && chan[i].wave == 5))
        {
          chan[i].freqChanged = true;
        }

        chan[i].wave = chan[i].std.wave.val;
      }
      if(i == 5 || i == 6 || i == 7)
      {
        ad9833_write(i, 9, chan[i].std.wave.val);

        chan[i].freqChanged = true;

        chan[i].wave = chan[i].std.wave.val;
      }
    }

    if (chan[i].std.phaseReset.had) {
      if(i < 5 && chan[i].std.phaseReset.val)
      {
        ad9833_write(i, 3, chan[i].lfsr); //LFSR value is ignored for all chans except noise
      }
      if(i > 8) //phase reset for phase reset timers lmao
      {
        ad9833_write(i, 2, 0);
      }
    }

    if (chan[i].std.ex1.had) { //zero cross detection
      if(i < 7)
      {
        ad9833_write(i, 6, chan[i].std.ex1.val);
      }
    }

    if (chan[i].std.ex2.had) { //LFSR bits
      if(i == 4)
      {
        chan[i].lfsr = chan[i].std.ex2.val;
      }
    }

    if (chan[i].std.ex3.had) { //wavetable index
      if(i > 4 && i < 8 && chan[i].do_wavetable)
      {
        chan[i].wavetable = chan[i].std.ex3.val;
        chan[i].ws.changeWave1(chan[i].wavetable);
        chan[i].updateWave = true;
      }
    }

    if (chan[i].std.ex4.had) { //noise/triangle amplitude
      if(i > 4 && i < 7 && (chan[i].wave > 1 && chan[i].wave < 6)) //PWM DAC doesn't have noise/tri gen
      {
        chan[i].noise_tri_amp = chan[i].std.ex4.val;
        ad9833_write(i, 11, chan[i].std.ex4.val);
        chan[i].freqChanged = true;
      }
    }

    if (chan[i].std.ex5.had) { //phase reset timers channel bitmask
      if((i >= 8 && i < 14))
      {
        ad9833_write(i, 0, chan[i].std.ex5.val);
      }
    }

    if (chan[i].std.ex6.had) { //noise clock internal/external
      if(i == 4)
      {
        ad9833_write(i, 1, chan[i].std.ex6.val);
        chan[i].extNoiseClk = !chan[i].std.ex6.val;
      }
    }
    
    if (chan[i].active && i > 4 && i < 8 && chan[i].do_wavetable && chan[i].wave == 1) {
      if (chan[i].ws.tick()) {
        //updateWave(i);
        chan[i].updateWave = true;
      }
    }

    if(chan[i].updateWave)
    {
      updateWave(i);
      chan[i].updateWave = false;
    }

    if(chan[i].apply_sample)
    {
      DivSample* s = parent->song.sample[chan[i].dacSample];

      unsigned int sample_offset = chan[i].sampleInRam ? (sampleOffRam[chan[i].dacSample]) : sampleOff[chan[i].dacSample];

      if(chan[i].set_sample_pos)
      {
        sample_offset += chan[i].sample_offset;
      }

      if(sample_offset >= (chan[i].sampleInRam ? (sampleOffRam[chan[i].dacSample]) : sampleOff[chan[i].dacSample]) + s->length8)
      {
        sample_offset = (chan[i].sampleInRam ? (sampleOffRam[chan[i].dacSample]) : sampleOff[chan[i].dacSample]) + s->length8 - 1;
      }

      if(chan[i].sampleInRam)
      {
        sample_offset |= 0x1000000;
      }

      ad9833_write(i, 2, sample_offset);
      if(s->loop)
      {
        ad9833_write(i, 7, ((chan[i].sampleInRam ? (sampleOffRam[chan[i].dacSample]) : sampleOff[chan[i].dacSample]) + s->loopStart) | (chan[i].sampleInRam ? 0x1000000 : 0)); // loop point
      }
      else
      {
        //ad9833_write(i, 7, sampleOff[chan[i].dacSample] | (chan[i].sampleInRam ? 0x1000000 : 0)); // loop point = start
      }
      ad9833_write(i, 8, ((chan[i].sampleInRam ? (sampleOffRam[chan[i].dacSample]) : sampleOff[chan[i].dacSample]) + s->length8) | (chan[i].sampleInRam ? 0x1000000 : 0));

