furmilion/furnace-fur/src/engine/platform/stm32crapsynth.cpp
      if(crap_synth->dac[i - 5].playing)
      {
        ad9833_write(i, 1, 0); //stop playing sample
      }

      ad9833_write(i, 1, 1 | (chan[i].do_wavetable ? 2 : 0) | (s->loop ? 4 : 0) | (chan[i].sampleInRam ? 8 : 0)); //play sample

      chan[i].apply_sample = false;
      chan[i].set_sample_pos = false;
    }

    bool write_pwm_freq = false;

    if (chan[i].freqChanged || chan[i].keyOn || chan[i].keyOff) {
      //DivInstrument* ins=parent->getIns(chan[i].ins,DIV_INS_STM32CRAPSYNTH);
      if(chan[i].freqChanged && i < 4)
      {
        chan[i].freq=parent->calcFreq(chan[i].baseFreq,chan[i].pitch,chan[i].fixedArp?chan[i].baseNoteOverride:chan[i].arpOff,chan[i].fixedArp,false,2,chan[i].pitch2,chipClock/2,CHIP_FREQBASE);
        chan[i].timer_freq=parent->calcFreq(chan[i].baseFreq,chan[i].pitch,chan[i].fixedArp?chan[i].baseNoteOverride:chan[i].arpOff,chan[i].fixedArp,false,2,chan[i].pitch2,chipClock/2,CHIP_TIMERS_FREQBASE);

        if(chan[i].freq > (1 << 28) - 1) chan[i].freq = (1 << 28) - 1;
        if(chan[i].timer_freq > (1 << 30) - 1) chan[i].freq = (1 << 30) - 1;
        
        if(chan[i].wave != 5)
        {
            ad9833_write(i, 2, chan[i].freq);
        }
        else
        {
            //ad9833_write(i, 4, chan[i].timer_freq);
            write_pwm_freq = true;
        }
      }
      if(chan[i].freqChanged && i == 4) //&& chan[4].extNoiseClk)
      {
        chan[i].freq=parent->calcFreq(chan[i].baseFreq,chan[i].pitch,chan[i].fixedArp?chan[i].baseNoteOverride:chan[i].arpOff,chan[i].fixedArp,false,2,chan[i].pitch2,chipClock/2,CHIP_TIMERS_FREQBASE * 32);
        chan[i].timer_freq=chan[i].freq;

        while((double)chan[i].freq > 333300.0 * (double)(1 << 29) / (double)(chipClock/2)) //333333.(3) Hz max MM5437 clock freq
        {
            chan[i].freq = 333300.0 * (double)(1 << 29) / (double)(chipClock/2);
            chan[i].timer_freq=chan[i].freq;
        }

        //if(chan[i].freq > (1 << 30) - 1) chan[i].freq = (1 << 30) - 1;
        //if(chan[i].timer_freq > (1 << 30) - 1) chan[i].freq = (1 << 30) - 1;
        
        ad9833_write(i, 4, chan[i].timer_freq);
      }
      if(chan[i].freqChanged && (i == 5 || i == 6 || i == 7))
      {
        chan[i].freq=parent->calcFreq(chan[i].baseFreq,chan[i].pitch,chan[i].fixedArp?chan[i].baseNoteOverride:chan[i].arpOff,chan[i].fixedArp,false,2,chan[i].pitch2,chipClock/2,CHIP_TIMERS_FREQBASE * 32);
        chan[i].timer_freq=chan[i].freq;

        switch(chan[i].wave)
        {
          case 1:
          case 3:
          case 5:
          {
            if(chan[i].pcm)
            {
              double off=1.0;
              if (chan[i].dacSample>=0 && chan[i].dacSample<parent->song.sampleLen) {
                DivSample* s=parent->getSample(chan[i].dacSample);
                if (s->centerRate<1) {
                  off=1.0;
                } else {
                  off=8363.0/(double)s->centerRate;
                }
              }
              chan[i].timer_freq *= off * 2.0;
            }
            else
            {
              chan[i].timer_freq *= 8; //wavetable
            }
            break;
          }
          case 2: //triangle
          {
            chan[i].timer_freq *= (1 << chan[i].noise_tri_amp);
            chan[i].timer_freq /= 16;
            break;
          }
          case 4: //noise
          {
            chan[i].timer_freq *= 2;
            break;
          }
          case 6:
          case 7:
          {
            chan[i].timer_freq *= 8; //wavetable
            break;
          }
          default: break;
        }

        if(chan[i].freq > (1 << 30) - 1) chan[i].freq = (1 << 30) - 1;
        if(chan[i].timer_freq > (1 << 30) - 1) chan[i].timer_freq = (1 << 30) - 1;
        
        ad9833_write(i, 4, chan[i].timer_freq);
      }
      if(chan[i].freqChanged && i >= 8) //phase reset timers
      {
        chan[i].freq=parent->calcFreq(chan[i].baseFreq,chan[i].pitch,chan[i].fixedArp?chan[i].baseNoteOverride:chan[i].arpOff,chan[i].fixedArp,false,2,chan[i].pitch2,chipClock/2,CHIP_FREQBASE*4);
        chan[i].timer_freq=chan[i].freq;

        if(i == 8 + 1) //systick timer can't go below 4.29 Hz (72 MHz / 2^24)
        {
          if(chan[i].freq < (double)(1 << 29) * 4.29 / (double)(chipClock/2))
          {
            chan[i].freq = (double)(1 << 29) * 4.29 / (double)(chipClock/2);
            chan[i].timer_freq = chan[i].freq;
          }
        }

        if(chan[i].freq > (1 << 30) - 1) chan[i].freq = (1 << 30) - 1;
        if(chan[i].timer_freq > (1 << 30) - 1) chan[i].freq = (1 << 30) - 1;

        ad9833_write(i, 1, chan[i].timer_freq);
      }
      if(chan[i].keyOff && i < 8)
      {
        ad9833_write(i, 0, 0);

        if(i > 4)
        {
          ad9833_write(i, 1, 0); //stop wave/sample playback
        }
      }
      if(chan[i].keyOff && i >= 8)
      {
        ad9833_write(i, 3, 0);
      }

      if (chan[i].keyOn) chan[i].keyOn=false;
      if (chan[i].keyOff) chan[i].keyOff=false;
      chan[i].freqChanged=false;
    }

    if (chan[i].std.duty.had) { //duty after freq for export proper duty to compare count register conversion
      if(i < 4 || i == 5 || i == 6 || i == 7)
      {
        chan[i].duty = chan[i].std.duty.val;
        if(i < 4)
        {
          ad9833_write(i, 5, chan[i].std.duty.val);
        }
        if((i == 5 || i == 6 || i == 7) && chan[i].wave == 6)
        {
          ad9833_write(i, 9, ((uint32_t)chan[i].wave | (((uint32_t)chan[i].duty >> 8) << 4)));
        }
      }
    }

    if(write_pwm_freq)
    {
      ad9833_write(i, 4, chan[i].timer_freq);
      write_pwm_freq = false;
    }
  }
}

int DivPlatformSTM32CRAPSYNTH::dispatch(DivCommand c) {
  switch (c.cmd) {
    case DIV_CMD_NOTE_ON: {
      DivInstrument* ins=parent->getIns(chan[c.chan].ins,DIV_INS_STM32CRAPSYNTH);
      if (c.value!=DIV_NOTE_NULL) {
        chan[c.chan].baseFreq=NOTE_FREQUENCY(c.value);
        chan[c.chan].freqChanged=true;
        chan[c.chan].note=c.value;
      }
      chan[c.chan].active=true;
      chan[c.chan].keyOn=true;
      chan[c.chan].macroInit(ins);
      if (!parent->song.brokenOutVol && !chan[c.chan].std.vol.will) {
        chan[c.chan].outVol=chan[c.chan].vol;
      }
      if (chan[c.chan].wavetable<0) {
        chan[c.chan].wavetable=0;
        chan[c.chan].ws.changeWave1(chan[c.chan].wavetable);
      }
      
      chan[c.chan].insChanged=false;

      if (!ins->amiga.useSample && c.chan > 4 && c.chan < 8) {
        chan[c.chan].pcm = false;
        chan[c.chan].do_wavetable = true;
        chan[c.chan].ws.init(ins,256,256,chan[c.chan].insChanged);
        chan[c.chan].updateWave = true;
        chan[c.chan].freqChanged = true;
        ad9833_write(c.chan, 1, 1 | (chan[c.chan].do_wavetable ? 2 : 0)); //play wave
      }
      if (ins->amiga.useSample && c.chan > 4 && c.chan < 8) {
        chan[c.chan].pcm = true;
        chan[c.chan].do_wavetable = false;
        if (c.value!=DIV_NOTE_NULL) {
          chan[c.chan].dacSample=ins->amiga.getSample(c.value);
          chan[c.chan].sampleNote=c.value;
          c.value=ins->amiga.getFreq(c.value);
          chan[c.chan].sampleNoteDelta=c.value-chan[c.chan].sampleNote;
          chan[c.chan].baseFreq = NOTE_FREQUENCY(c.value);
          chan[c.chan].freqChanged = true;
          chan[c.chan].note = c.value; //hack but works?
        } else if (chan[c.chan].sampleNote!=DIV_NOTE_NULL) {
          chan[c.chan].dacSample=ins->amiga.getSample(chan[c.chan].sampleNote);
          c.value=ins->amiga.getFreq(chan[c.chan].sampleNote);
        }
        if (chan[c.chan].dacSample<0 || chan[c.chan].dacSample>=parent->song.sampleLen) {
          chan[c.chan].dacSample=-1;
          //if (dumpWrites) addWrite(0xffff0002+(c.chan<<8),0);
          break;
        } else {
          //if (dumpWrites) {
            //addWrite(0xffff0000+(c.chan<<8),chan[c.chan].dacSample);
          //}
          chan[c.chan].sampleInRam = false;

          if(chan[c.chan].dacSample < parent->song.sampleLen && chan[c.chan].dacSample >= 0)
          {
            if(!sampleLoaded[0][chan[c.chan].dacSample] && !sampleLoaded[1][chan[c.chan].dacSample]) break;

            if(sampleLoaded[0][chan[c.chan].dacSample])
            {
              chan[c.chan].sampleInRam = false;
            }
            if(sampleLoaded[1][chan[c.chan].dacSample])
            {
              chan[c.chan].sampleInRam = true;
            }
            
            chan[c.chan].apply_sample = true;
          }
        }
        chan[c.chan].dacPos=0;
        chan[c.chan].dacPeriod=0;
      }

      if(c.chan >= 8) //phase reset timers
      {
        ad9833_write(c.chan, 3, 1);
      }
      /*else
      {
        chan[c.chan].pcm = false;
      }*/
      break;
    }
    case DIV_CMD_NOTE_OFF:
      chan[c.chan].dacSample=-1;
      //if (dumpWrites) addWrite(0xffff0002+(c.chan<<8),0);
      chan[c.chan].pcm=false;
      chan[c.chan].active=false;
      chan[c.chan].keyOff=true;
      chan[c.chan].macroInit(NULL);
      break;
    case DIV_CMD_NOTE_OFF_ENV:
    case DIV_CMD_ENV_RELEASE:
      chan[c.chan].std.release();
      if(c.chan >= 8)
      {
        chan[c.chan].keyOff=true;
      }
      break;
    case DIV_CMD_INSTRUMENT:
      if (chan[c.chan].ins!=c.value || c.value2==1) {
        chan[c.chan].ins=c.value;
        chan[c.chan].insChanged=true;
      }
      break;
    case DIV_CMD_VOLUME:
      if (chan[c.chan].vol!=c.value) {
        chan[c.chan].vol=c.value;
        if (!chan[c.chan].std.vol.has) {
          chan[c.chan].outVol=c.value;
          chan[c.chan].vol=chan[c.chan].outVol;
        }

        if(c.chan < 4)
        {
            ad9833_write(c.chan, 0, (VOL_SCALE_LOG(crap_synth->ad9833[c.chan].zero_cross ? crap_synth->ad9833[c.chan].pending_vol : crap_synth->volume[c.chan],chan[c.chan].outVol&255,255)));
        }
      }
      break;
    case DIV_CMD_GET_VOLUME:
      if (chan[c.chan].std.vol.has) {
        return chan[c.chan].vol;
      }
      return chan[c.chan].outVol;
      break;
    case DIV_CMD_PITCH:
      chan[c.chan].pitch=c.value;
      chan[c.chan].freqChanged=true;
      break;
    case DIV_CMD_WAVE:
      chan[c.chan].wave=c.value;
      /*if(c.chan > 4 && c.chan < 7 && chan[c.chan].do_wavetable)
      {
        chan[c.chan].ws.changeWave1(chan[c.chan].wavetable);
      }*/
      
      if(c.chan < 4 || (c.chan > 4 && c.chan < 8))
      {
        ad9833_write(c.chan, 1, c.value);
      }
      
      break;
    case DIV_CMD_NOTE_PORTA: {
      int destFreq=NOTE_PERIODIC(c.value2+chan[c.chan].sampleNoteDelta);
      bool return2=false;
      if (destFreq>chan[c.chan].baseFreq) {
        chan[c.chan].baseFreq+=c.value;
        if (chan[c.chan].baseFreq>=destFreq) {
          chan[c.chan].baseFreq=destFreq;
          return2=true;
        }
      } else {
        chan[c.chan].baseFreq-=c.value;
        if (chan[c.chan].baseFreq<=destFreq) {
          chan[c.chan].baseFreq=destFreq;
          return2=true;
        }
      }
      chan[c.chan].freqChanged=true;
      if (return2) {
        chan[c.chan].inPorta=false;
        return 2;
      }
      break;
    }
    case DIV_CMD_LEGATO:
      chan[c.chan].baseFreq=NOTE_PERIODIC(c.value+chan[c.chan].sampleNoteDelta+((HACKY_LEGATO_MESS)?(chan[c.chan].std.arp.val):(0)));
      chan[c.chan].freqChanged=true;
      chan[c.chan].note=c.value;
      break;
    case DIV_CMD_PRE_PORTA:
      if (chan[c.chan].active && c.value2) {
        if (parent->song.resetMacroOnPorta) chan[c.chan].macroInit(parent->getIns(chan[c.chan].ins,DIV_INS_PCE));
      }
      if (!chan[c.chan].inPorta && c.value && !parent->song.brokenPortaArp && chan[c.chan].std.arp.will && !NEW_ARP_STRAT) chan[c.chan].baseFreq=NOTE_PERIODIC(chan[c.chan].note);
      chan[c.chan].inPorta=c.value;
      break;
    case DIV_CMD_SAMPLE_POS:
      if (chan[c.chan].do_wavetable) break;
      if(c.chan > 6 || c.chan < 4) break;
      chan[c.chan].sample_offset=c.value;
      chan[c.chan].set_sample_pos = true;
      break;
    case DIV_CMD_GET_VOLMAX:
      return 255;
      break;
    case DIV_CMD_MACRO_OFF:
      chan[c.chan].std.mask(c.value,true);
      break;
    case DIV_CMD_MACRO_ON:
      chan[c.chan].std.mask(c.value,false);
      break;
    case DIV_CMD_MACRO_RESTART:
      chan[c.chan].std.restart(c.value);
      break;
    default:
      break;
  }
  return 1;
}

void DivPlatformSTM32CRAPSYNTH::muteChannel(int ch, bool mute) {
  isMuted[ch]=mute;
  crapsynth_set_is_muted(crap_synth, ch, mute);
}

void DivPlatformSTM32CRAPSYNTH::forceIns() {
  for (int i=0; i<STM32CRAPSYNTH_NUM_CHANNELS; i++) {
    chan[i].insChanged=true;
    chan[i].freqChanged=true;
    //updateWave(i);
    if(chan[i].wave == 1) chan[i].updateWave = true;
    //chWrite(i,0x05,isMuted[i]?0:chan[i].pan);
  }
}

void* DivPlatformSTM32CRAPSYNTH::getChanState(int ch) {
  return &chan[ch];
}

