furmilion/furnace-fur/src/engine/platform/stm32crapsynth.cpp
DivMacroInt* DivPlatformSTM32CRAPSYNTH::getChanMacroInt(int ch) {
  return &chan[ch].std;
}

void DivPlatformSTM32CRAPSYNTH::getPaired(int ch, std::vector<DivChannelPair>& ret) {
  /*if (ch==1 && lfoMode>0) {
    ret.push_back(DivChannelPair(_("mod"),0));
  }*/
}

DivChannelModeHints DivPlatformSTM32CRAPSYNTH::getModeHints(int ch) {
  DivChannelModeHints ret;
  if (ch<4) return ret;
  ret.count=1;
  ret.hint[0]=ICON_FUR_NOISE;
  ret.type[0]=0;
  
  return ret;
}

DivSamplePos DivPlatformSTM32CRAPSYNTH::getSamplePos(int ch) {
  if (ch < 5 || ch > 8) return DivSamplePos();
  if (!chan[ch].pcm) return DivSamplePos();

  int channel = ch - 5;

  if(chan[ch].dacSample < 0 || chan[ch].dacSample > parent->song.sampleLen) return DivSamplePos();

  //DivSample* s = parent->getSample(chan[ch].dacSample);

  uint32_t start_addr = (chan[ch].sampleInRam ? (sampleOffRam[chan[ch].dacSample]) : sampleOff[chan[ch].dacSample]);

  return DivSamplePos(
    chan[ch].dacSample,
    crap_synth->dac[channel].curr_pos - start_addr,
    (int)(double)(chipClock / 2) * (double)crap_synth->dac[channel].timer_freq / (double)(1 << 29)
  );

  //return DivSamplePos();
}

DivDispatchOscBuffer* DivPlatformSTM32CRAPSYNTH::getOscBuffer(int ch) {
  return oscBuf[ch];
}

int DivPlatformSTM32CRAPSYNTH::mapVelocity(int ch, float vel) {
  return round(31.0*pow(vel,0.22));
}

float DivPlatformSTM32CRAPSYNTH::getGain(int ch, int vol) {
  if (vol==0) return 0;
  return 1.0/pow(10.0,(float)(31-vol)*3.0/20.0);
}

unsigned char* DivPlatformSTM32CRAPSYNTH::getRegisterPool() {
  return (unsigned char*)regPool;
}

int DivPlatformSTM32CRAPSYNTH::getRegisterPoolSize() {
  return 8*11+8*6;
}

int DivPlatformSTM32CRAPSYNTH::getRegisterPoolDepth()
{
    return 32; // some of the registers of STM32 timers are 32-bit. or 24 bit. AD9833 phase acc/frequency is 28 bits...
}

void DivPlatformSTM32CRAPSYNTH::reset() {
  writes.clear();
  memset(regPool,0,(8*11 + 8 * 6)*sizeof(unsigned int));
  for (int i=0; i<STM32CRAPSYNTH_NUM_CHANNELS; i++) {
    chan[i]=DivPlatformSTM32CRAPSYNTH::Channel();
    chan[i].std.setEngine(parent);
    chan[i].ws.setEngine(parent);
    chan[i].ws.init(NULL,256,256,false);

    chan[i].duty = 0x7fff;
    chan[i].wave = 0;
    chan[i].noise_tri_amp = 11;
    chan[i].do_wavetable = false;
    chan[i].updateWave = false;
    chan[i].extNoiseClk = true;

    chan[i].apply_sample = false;
    chan[i].set_sample_pos = false;
    chan[i].sample_offset = 0;
  }
  if (dumpWrites) 
  {
    addWrite(0xffffffff,0);
  }
  crapsynth_reset(crap_synth);
  writeOscBuf = 0;

  Vhp = 0;
  Vbp = 0;
  Vlp = 0;

  _1024_div_Q = (1.0/(0.707));
  w0_ceil_1 = (2.0*3.1415*(float)5) / (float)rate;
}

int DivPlatformSTM32CRAPSYNTH::getOutputCount() {
  return 1;
}

bool DivPlatformSTM32CRAPSYNTH::keyOffAffectsArp(int ch) {
  return false;
}

void DivPlatformSTM32CRAPSYNTH::notifyWaveChange(int wave) {
  for (int i=0; i<STM32CRAPSYNTH_NUM_CHANNELS; i++) {
    if (chan[i].wavetable==wave && i > 4 && i < 8) {
      chan[i].ws.changeWave1(wave);
      //updateWave(i);
      chan[i].updateWave = true;
    }
  }
}

void DivPlatformSTM32CRAPSYNTH::notifyInsDeletion(void* ins) {
  for (int i=0; i<STM32CRAPSYNTH_NUM_CHANNELS; i++) {
    chan[i].std.notifyInsDeletion((DivInstrument*)ins);
  }
}

const void* DivPlatformSTM32CRAPSYNTH::getSampleMem(int index) {
  if(index > 1) return NULL;
  return index == 0 ? (unsigned char*)crap_synth->sample_mem_flash : (unsigned char*)crap_synth->sample_mem_ram;
}

size_t DivPlatformSTM32CRAPSYNTH::getSampleMemCapacity(int index) {
  if(index > 1) return 0;
  return index == 0 ? STM32CRAPSYNTH_FLASH_SAMPLE_MEM_SIZE : STM32CRAPSYNTH_RAM_SAMPLE_MEM_SIZE;
}

size_t DivPlatformSTM32CRAPSYNTH::getSampleMemUsage(int index) {
  if(index > 1) return 0;
  return index == 0 ? sampleMemLenFlash : sampleMemLenRam;
}

bool DivPlatformSTM32CRAPSYNTH::isSampleLoaded(int index, int sample) {
  if (index<0 || index>1) return false;
  if (sample<0 || sample>255) return false;
  return sampleLoaded[index][sample];
}

const DivMemoryComposition* DivPlatformSTM32CRAPSYNTH::getMemCompo(int index) {
  if (index>1) return NULL;
  return index == 0 ? &sampleMemFlashCompo : &sampleMemRamCompo;
}

void DivPlatformSTM32CRAPSYNTH::renderSamples(int sysID) {
  size_t maxPos=getSampleMemCapacity(0);

  memset(crap_synth->sample_mem_flash,0,maxPos);
  memset(sampleOff,0,256*sizeof(unsigned int));
  memset(sampleOffRam,0,256*sizeof(unsigned int));
  memset(sampleLoaded,0,256*2*sizeof(bool));

  //sample flash memory

  sampleMemFlashCompo=DivMemoryComposition();
  sampleMemFlashCompo.name=_("Sample memory (Flash)");
  //sampleMemFlashCompo.memory = (unsigned char*)crap_synth->sample_mem_flash;

  size_t memPos=0;
  for (int i=0; i<parent->song.sampleLen; i++) 
  {
    DivSample* s=parent->song.sample[i];
    if (!s->renderOn[0][sysID]) 
    {
      sampleOff[i]=0;
      continue;
    }
    int length=s->length8;
    int actualLength=MIN((int)(maxPos-memPos),length);
    if (actualLength>0) 
    {
      sampleOff[i]=memPos;
      //memcpy(&crap_synth->sample_mem_flash[memPos],s->data8,actualLength);
      for(int ssyka = 0; ssyka < actualLength; ssyka++)
      {
        crap_synth->sample_mem_flash[memPos + ssyka] = (uint8_t)s->data8[ssyka] + 0x80;
      }
      memPos+=actualLength;
      sampleMemFlashCompo.entries.push_back(DivMemoryEntry(DIV_MEMORY_SAMPLE,"PCM",i,sampleOff[i],memPos));
    }
    if (actualLength<length)
    {
      logW("out of STM32CrapSynth flash sample memory for sample %d!",i);
      break;
    }
    sampleLoaded[0][i]=true;
  }
  sampleMemLenFlash=memPos;
  sampleMemFlashCompo.used=sampleMemLenFlash;
  sampleMemFlashCompo.capacity=maxPos;

  //sample RAM

  maxPos=getSampleMemCapacity(1);
  memset(crap_synth->sample_mem_ram,0,maxPos);

  sampleMemRamCompo=DivMemoryComposition();
  sampleMemRamCompo.name=_("Sample memory (RAM)");
  //sampleMemRamCompo.memory = (unsigned char*)crap_synth->sample_mem_ram;

  memPos=0;
  for (int i=0; i<parent->song.sampleLen; i++) 
  {
    DivSample* s=parent->song.sample[i];
    if (!s->renderOn[1][sysID]) 
    {
      sampleOffRam[i]=0;
      continue;
    }
    int length=s->length8;
    int actualLength=MIN((int)(maxPos-memPos),length);
    if (actualLength>0) 
    {
      sampleOffRam[i]=memPos;
      //memcpy(&crap_synth->sample_mem_flash[memPos],s->data8,actualLength);
      for(int ssyka = 0; ssyka < actualLength; ssyka++)
      {
        crap_synth->sample_mem_ram[memPos + ssyka] = (uint8_t)s->data8[ssyka] + 0x80;
      }
      memPos+=actualLength;
      sampleMemRamCompo.entries.push_back(DivMemoryEntry(DIV_MEMORY_SAMPLE,"PCM",i,sampleOffRam[i],memPos));
    }
    if (actualLength<length) 
    {
      logW("out of STM32CrapSynth RAM sample memory for sample %d!",i);
      break;
    }
    sampleLoaded[1][i]=true;
  }
  sampleMemLenRam=memPos;
  sampleMemRamCompo.used=sampleMemLenRam;
  sampleMemRamCompo.capacity=maxPos;
}

void DivPlatformSTM32CRAPSYNTH::setFlags(const DivConfig& flags) {
  chipClock=2500000;
  CHECK_CUSTOM_CLOCK;
  rate=chipClock/10; // 250 kHz
  for (int i=0; i<STM32CRAPSYNTH_NUM_CHANNELS; i++) {
    oscBuf[i]->rate=rate;
  }
}

void DivPlatformSTM32CRAPSYNTH::poke(unsigned int addr, unsigned short val) {
  rWrite(addr,val);
}

void DivPlatformSTM32CRAPSYNTH::poke(std::vector<DivRegWrite>& wlist) {
  for (DivRegWrite& i: wlist) rWrite(i.addr,i.val);
}

int DivPlatformSTM32CRAPSYNTH::init(DivEngine* p, int channels, int sugRate, const DivConfig& flags) {
  parent=p;
  dumpWrites=false;
  skipRegisterWrites=false;
  for (int i=0; i<STM32CRAPSYNTH_NUM_CHANNELS; i++) {
    isMuted[i]=false;
    oscBuf[i]=new DivDispatchOscBuffer;
  }
  crap_synth = crapsynth_create();

  sampleMemFlashCompo=DivMemoryComposition();
  sampleMemFlashCompo.name=_("Sample memory (Flash)");
  sampleMemFlashCompo.capacity=STM32CRAPSYNTH_FLASH_SAMPLE_MEM_SIZE;
  //sampleMemFlashCompo.memory=(unsigned char*)crap_synth->sample_mem_flash;

  sampleMemRamCompo=DivMemoryComposition();
  sampleMemRamCompo.name=_("Sample memory (RAM)");
  sampleMemRamCompo.capacity=STM32CRAPSYNTH_RAM_SAMPLE_MEM_SIZE;
  //sampleMemRamCompo.memory=(unsigned char*)crap_synth->sample_mem_ram;

  setFlags(flags);
  reset();
  return STM32CRAPSYNTH_NUM_CHANNELS;
}

void DivPlatformSTM32CRAPSYNTH::quit() {
  for (int i=0; i<STM32CRAPSYNTH_NUM_CHANNELS; i++) {
    delete oscBuf[i];
  }

  if (crap_synth!=NULL) {
    crapsynth_free(crap_synth);
  }
}

DivPlatformSTM32CRAPSYNTH::~DivPlatformSTM32CRAPSYNTH() {
}
